/* automatically generated by rust-bindgen */
#![allow(dead_code,non_camel_case_types,non_upper_case_globals,non_snake_case)]

pub const MINGW_HAS_SECURE_API: ::std::os::raw::c_uint = 1;
pub const __MINGW64_VERSION_MAJOR: ::std::os::raw::c_uint = 5;
pub const __MINGW64_VERSION_MINOR: ::std::os::raw::c_uint = 0;
pub const __MINGW64_VERSION_RC: ::std::os::raw::c_uint = 0;
pub const __MINGW64_VERSION_STATE: &'static [u8; 6usize] = b"alpha\0";
pub const __MINGW32_MAJOR_VERSION: ::std::os::raw::c_uint = 3;
pub const __MINGW32_MINOR_VERSION: ::std::os::raw::c_uint = 11;
pub const _M_AMD64: ::std::os::raw::c_uint = 100;
pub const _M_X64: ::std::os::raw::c_uint = 100;
pub const __: ::std::os::raw::c_uint = 1;
pub const __MINGW_USE_UNDERSCORE_PREFIX: ::std::os::raw::c_uint = 0;
pub const __MINGW_HAVE_ANSI_C99_PRINTF: ::std::os::raw::c_uint = 1;
pub const __MINGW_HAVE_WIDE_C99_PRINTF: ::std::os::raw::c_uint = 1;
pub const __MINGW_HAVE_ANSI_C99_SCANF: ::std::os::raw::c_uint = 1;
pub const __MINGW_HAVE_WIDE_C99_SCANF: ::std::os::raw::c_uint = 1;
pub const __MINGW_SEC_WARN_STR : & 'static [ u8 ; 92usize ] = b"This function or variable may be unsafe, use _CRT_SECURE_NO_WARNINGS to disable deprecation\0" ;
pub const __MINGW_MSVC2005_DEPREC_STR : & 'static [ u8 ; 117usize ] = b"This POSIX function is deprecated beginning in Visual C++ 2005, use _CRT_NONSTDC_NO_DEPRECATE to disable deprecation\0" ;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: ::std::os::raw::c_uint = 0;

pub const SCN_PAINTED: ::std::os::raw::c_uint = 2013;
pub const SCN_USERLISTSELECTION: ::std::os::raw::c_uint = 2014;
pub const SCN_URIDROPPED: ::std::os::raw::c_uint = 2015;
pub const SCN_DWELLSTART: ::std::os::raw::c_uint = 2016;
pub const SCN_DWELLEND: ::std::os::raw::c_uint = 2017;
pub const SCN_ZOOM: ::std::os::raw::c_uint = 2018;
pub const SCN_HOTSPOTCLICK: ::std::os::raw::c_uint = 2019;
pub const SCN_HOTSPOTDOUBLECLICK: ::std::os::raw::c_uint = 2020;
pub const SCN_CALLTIPCLICK: ::std::os::raw::c_uint = 2021;
pub const SCN_AUTOCSELECTION: ::std::os::raw::c_uint = 2022;
pub const SCN_INDICATORCLICK: ::std::os::raw::c_uint = 2023;
pub const SCN_INDICATORRELEASE: ::std::os::raw::c_uint = 2024;
pub const SCN_AUTOCCANCELLED: ::std::os::raw::c_uint = 2025;
pub const SCN_AUTOCCHARDELETED: ::std::os::raw::c_uint = 2026;
pub const SCN_HOTSPOTRELEASECLICK: ::std::os::raw::c_uint = 2027;
pub const SCN_FOCUSIN: ::std::os::raw::c_uint = 2028;
pub const SCN_FOCUSOUT: ::std::os::raw::c_uint = 2029;
pub const SCN_AUTOCCOMPLETED: ::std::os::raw::c_uint = 2030;
pub const SCN_MARGINRIGHTCLICK: ::std::os::raw::c_uint = 2031;
pub const SCN_AUTOCSELECTIONCHANGE: ::std::os::raw::c_uint = 2032;
pub const SC_BIDIRECTIONAL_DISABLED: ::std::os::raw::c_uint = 0;
pub const SC_BIDIRECTIONAL_L2R: ::std::os::raw::c_uint = 1;
pub const SC_BIDIRECTIONAL_R2L: ::std::os::raw::c_uint = 2;
pub const SCI_GETBIDIRECTIONAL: ::std::os::raw::c_uint = 2708;
pub const SCI_SETBIDIRECTIONAL: ::std::os::raw::c_uint = 2709;
#[cfg(target_os = "windows")]
extern "C" {
    pub fn Scintilla_RegisterClasses(hInstance: *mut ::std::os::raw::c_void)
                                     -> ::std::os::raw::c_int;
}
#[cfg(target_os = "windows")]
extern "C" {
    pub fn Scintilla_ReleaseResources() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Scintilla_LinkLexers() -> ::std::os::raw::c_int;
}
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __gnuc_va_list;
extern "C" {
    pub fn __mingw_get_crt_info() -> *const ::std::os::raw::c_char;
}
pub type rsize_t = usize;
pub type wchar_t = ::std::os::raw::c_ushort;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type errno_t = ::std::os::raw::c_int;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
pub type time_t = __time64_t;
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct threadmbcinfostruct {
    _unused: [u8; 0],
}
pub type pthreadlocinfo = *mut threadlocaleinfostruct;
pub type pthreadmbcinfo = *mut threadmbcinfostruct;
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct __lc_time_data {
    _unused: [u8; 0],
}
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct localeinfo_struct {
    pub locinfo: pthreadlocinfo,
    pub mbcinfo: pthreadmbcinfo,
}
# [ test ]
fn bindgen_test_layout_localeinfo_struct() {
    assert_eq!(::std::mem::size_of::<localeinfo_struct>(),
               16usize,
               concat!("Size of: ", stringify!(localeinfo_struct)));
    assert_eq!(::std::mem::align_of::<localeinfo_struct>(),
               8usize,
               concat!("Alignment of ", stringify!(localeinfo_struct)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<localeinfo_struct>())).locinfo as *const _ as usize
               },
               0usize,
               concat!("Offset of field: ",
                       stringify!(localeinfo_struct),
                       "::",
                       stringify!(locinfo)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<localeinfo_struct>())).mbcinfo as *const _ as usize
               },
               8usize,
               concat!("Offset of field: ",
                       stringify!(localeinfo_struct),
                       "::",
                       stringify!(mbcinfo)));
}
pub type _locale_tstruct = localeinfo_struct;
pub type _locale_t = *mut localeinfo_struct;
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct tagLC_ID {
    pub wLanguage: ::std::os::raw::c_ushort,
    pub wCountry: ::std::os::raw::c_ushort,
    pub wCodePage: ::std::os::raw::c_ushort,
}
# [ test ]
fn bindgen_test_layout_tagLC_ID() {
    assert_eq!(::std::mem::size_of::<tagLC_ID>(),
               6usize,
               concat!("Size of: ", stringify!(tagLC_ID)));
    assert_eq!(::std::mem::align_of::<tagLC_ID>(),
               2usize,
               concat!("Alignment of ", stringify!(tagLC_ID)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<tagLC_ID>())).wLanguage as *const _ as usize },
               0usize,
               concat!("Offset of field: ",
                       stringify!(tagLC_ID),
                       "::",
                       stringify!(wLanguage)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<tagLC_ID>())).wCountry as *const _ as usize },
               2usize,
               concat!("Offset of field: ",
                       stringify!(tagLC_ID),
                       "::",
                       stringify!(wCountry)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<tagLC_ID>())).wCodePage as *const _ as usize },
               4usize,
               concat!("Offset of field: ",
                       stringify!(tagLC_ID),
                       "::",
                       stringify!(wCodePage)));
}
pub type LC_ID = tagLC_ID;
pub type LPLC_ID = *mut tagLC_ID;
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct threadlocaleinfostruct {
    pub refcount: ::std::os::raw::c_int,
    pub lc_codepage: ::std::os::raw::c_uint,
    pub lc_collate_cp: ::std::os::raw::c_uint,
    pub lc_handle: [::std::os::raw::c_ulong; 6usize],
    pub lc_id: [LC_ID; 6usize],
    pub lc_category: [threadlocaleinfostruct__bindgen_ty_1; 6usize],
    pub lc_clike: ::std::os::raw::c_int,
    pub mb_cur_max: ::std::os::raw::c_int,
    pub lconv_intl_refcount: *mut ::std::os::raw::c_int,
    pub lconv_num_refcount: *mut ::std::os::raw::c_int,
    pub lconv_mon_refcount: *mut ::std::os::raw::c_int,
    pub lconv: *mut lconv,
    pub ctype1_refcount: *mut ::std::os::raw::c_int,
    pub ctype1: *mut ::std::os::raw::c_ushort,
    pub pctype: *const ::std::os::raw::c_ushort,
    pub pclmap: *const ::std::os::raw::c_uchar,
    pub pcumap: *const ::std::os::raw::c_uchar,
    pub lc_time_curr: *mut __lc_time_data,
}
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct threadlocaleinfostruct__bindgen_ty_1 {
    pub locale: *mut ::std::os::raw::c_char,
    pub wlocale: *mut wchar_t,
    pub refcount: *mut ::std::os::raw::c_int,
    pub wrefcount: *mut ::std::os::raw::c_int,
}
# [ test ]
fn bindgen_test_layout_threadlocaleinfostruct__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<threadlocaleinfostruct__bindgen_ty_1>(),
               32usize,
               concat!("Size of: ",
                       stringify!(threadlocaleinfostruct__bindgen_ty_1)));
    assert_eq!(::std::mem::align_of::<threadlocaleinfostruct__bindgen_ty_1>(),
               8usize,
               concat!("Alignment of ",
                       stringify!(threadlocaleinfostruct__bindgen_ty_1)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct__bindgen_ty_1>())).locale as
                   *const _ as usize
               },
               0usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct__bindgen_ty_1),
                       "::",
                       stringify!(locale)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct__bindgen_ty_1>())).wlocale as
                   *const _ as usize
               },
               8usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct__bindgen_ty_1),
                       "::",
                       stringify!(wlocale)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct__bindgen_ty_1>())).refcount as
                   *const _ as usize
               },
               16usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct__bindgen_ty_1),
                       "::",
                       stringify!(refcount)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct__bindgen_ty_1>())).wrefcount as
                   *const _ as usize
               },
               24usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct__bindgen_ty_1),
                       "::",
                       stringify!(wrefcount)));
}
# [ test ]
fn bindgen_test_layout_threadlocaleinfostruct() {
    assert_eq!(::std::mem::size_of::<threadlocaleinfostruct>(),
               352usize,
               concat!("Size of: ", stringify!(threadlocaleinfostruct)));
    assert_eq!(::std::mem::align_of::<threadlocaleinfostruct>(),
               8usize,
               concat!("Alignment of ", stringify!(threadlocaleinfostruct)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).refcount as *const _ as usize
               },
               0usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(refcount)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).lc_codepage as *const _ as
                   usize
               },
               4usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(lc_codepage)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).lc_collate_cp as *const _ as
                   usize
               },
               8usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(lc_collate_cp)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).lc_handle as *const _ as usize
               },
               12usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(lc_handle)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).lc_id as *const _ as usize
               },
               36usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(lc_id)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).lc_category as *const _ as
                   usize
               },
               72usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(lc_category)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).lc_clike as *const _ as usize
               },
               264usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(lc_clike)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).mb_cur_max as *const _ as
                   usize
               },
               268usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(mb_cur_max)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).lconv_intl_refcount as
                   *const _ as usize
               },
               272usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(lconv_intl_refcount)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).lconv_num_refcount as
                   *const _ as usize
               },
               280usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(lconv_num_refcount)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).lconv_mon_refcount as
                   *const _ as usize
               },
               288usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(lconv_mon_refcount)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).lconv as *const _ as usize
               },
               296usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(lconv)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).ctype1_refcount as
                   *const _ as usize
               },
               304usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(ctype1_refcount)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).ctype1 as *const _ as usize
               },
               312usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(ctype1)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).pctype as *const _ as usize
               },
               320usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(pctype)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).pclmap as *const _ as usize
               },
               328usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(pclmap)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).pcumap as *const _ as usize
               },
               336usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(pcumap)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<threadlocaleinfostruct>())).lc_time_curr as *const _ as
                   usize
               },
               344usize,
               concat!("Offset of field: ",
                       stringify!(threadlocaleinfostruct),
                       "::",
                       stringify!(lc_time_curr)));
}
pub type threadlocinfo = threadlocaleinfostruct;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type int_least32_t = ::std::os::raw::c_int;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type int_fast16_t = ::std::os::raw::c_short;
pub type uint_fast16_t = ::std::os::raw::c_ushort;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type uptr_t = usize;
pub type sptr_t = isize;
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: f64,
}
# [ test ]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(::std::mem::size_of::<max_align_t>(),
               32usize,
               concat!("Size of: ", stringify!(max_align_t)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as
                   usize
               },
               0usize,
               concat!("Offset of field: ",
                       stringify!(max_align_t),
                       "::",
                       stringify!(__clang_max_align_nonce1)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as
                   usize
               },
               16usize,
               concat!("Offset of field: ",
                       stringify!(max_align_t),
                       "::",
                       stringify!(__clang_max_align_nonce2)));
}
pub type Sci_Position = isize;
pub type Sci_PositionU = usize;
pub type Sci_PositionCR = ::std::os::raw::c_long;
pub type SciFnDirect =
    ::std::option::Option<unsafe extern "C" fn(ptr: sptr_t,
                                               iMessage: ::std::os::raw::c_uint,
                                               wParam: uptr_t,
                                               lParam: sptr_t)
                                               -> sptr_t>;
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct Sci_CharacterRange {
    pub cpMin: Sci_PositionCR,
    pub cpMax: Sci_PositionCR,
}
# [ test ]
fn bindgen_test_layout_Sci_CharacterRange() {
    assert_eq!(::std::mem::size_of::<Sci_CharacterRange>(),
               8usize,
               concat!("Size of: ", stringify!(Sci_CharacterRange)));
    assert_eq!(::std::mem::align_of::<Sci_CharacterRange>(),
               4usize,
               concat!("Alignment of ", stringify!(Sci_CharacterRange)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<Sci_CharacterRange>())).cpMin as *const _ as usize
               },
               0usize,
               concat!("Offset of field: ",
                       stringify!(Sci_CharacterRange),
                       "::",
                       stringify!(cpMin)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<Sci_CharacterRange>())).cpMax as *const _ as usize
               },
               4usize,
               concat!("Offset of field: ",
                       stringify!(Sci_CharacterRange),
                       "::",
                       stringify!(cpMax)));
}
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct Sci_TextRange {
    pub chrg: Sci_CharacterRange,
    pub lpstrText: *mut ::std::os::raw::c_char,
}
# [ test ]
fn bindgen_test_layout_Sci_TextRange() {
    assert_eq!(::std::mem::size_of::<Sci_TextRange>(),
               16usize,
               concat!("Size of: ", stringify!(Sci_TextRange)));
    assert_eq!(::std::mem::align_of::<Sci_TextRange>(),
               8usize,
               concat!("Alignment of ", stringify!(Sci_TextRange)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_TextRange>())).chrg as *const _ as usize },
               0usize,
               concat!("Offset of field: ",
                       stringify!(Sci_TextRange),
                       "::",
                       stringify!(chrg)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_TextRange>())).lpstrText as *const _ as usize },
               8usize,
               concat!("Offset of field: ",
                       stringify!(Sci_TextRange),
                       "::",
                       stringify!(lpstrText)));
}
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct Sci_TextToFind {
    pub chrg: Sci_CharacterRange,
    pub lpstrText: *const ::std::os::raw::c_char,
    pub chrgText: Sci_CharacterRange,
}
# [ test ]
fn bindgen_test_layout_Sci_TextToFind() {
    assert_eq!(::std::mem::size_of::<Sci_TextToFind>(),
               24usize,
               concat!("Size of: ", stringify!(Sci_TextToFind)));
    assert_eq!(::std::mem::align_of::<Sci_TextToFind>(),
               8usize,
               concat!("Alignment of ", stringify!(Sci_TextToFind)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_TextToFind>())).chrg as *const _ as usize },
               0usize,
               concat!("Offset of field: ",
                       stringify!(Sci_TextToFind),
                       "::",
                       stringify!(chrg)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<Sci_TextToFind>())).lpstrText as *const _ as usize
               },
               8usize,
               concat!("Offset of field: ",
                       stringify!(Sci_TextToFind),
                       "::",
                       stringify!(lpstrText)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_TextToFind>())).chrgText as *const _ as usize },
               16usize,
               concat!("Offset of field: ",
                       stringify!(Sci_TextToFind),
                       "::",
                       stringify!(chrgText)));
}
pub type Sci_SurfaceID = *mut ::std::os::raw::c_void;
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct Sci_Rectangle {
    pub left: ::std::os::raw::c_int,
    pub top: ::std::os::raw::c_int,
    pub right: ::std::os::raw::c_int,
    pub bottom: ::std::os::raw::c_int,
}
# [ test ]
fn bindgen_test_layout_Sci_Rectangle() {
    assert_eq!(::std::mem::size_of::<Sci_Rectangle>(),
               16usize,
               concat!("Size of: ", stringify!(Sci_Rectangle)));
    assert_eq!(::std::mem::align_of::<Sci_Rectangle>(),
               4usize,
               concat!("Alignment of ", stringify!(Sci_Rectangle)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_Rectangle>())).left as *const _ as usize },
               0usize,
               concat!("Offset of field: ",
                       stringify!(Sci_Rectangle),
                       "::",
                       stringify!(left)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_Rectangle>())).top as *const _ as usize },
               4usize,
               concat!("Offset of field: ",
                       stringify!(Sci_Rectangle),
                       "::",
                       stringify!(top)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_Rectangle>())).right as *const _ as usize },
               8usize,
               concat!("Offset of field: ",
                       stringify!(Sci_Rectangle),
                       "::",
                       stringify!(right)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_Rectangle>())).bottom as *const _ as usize },
               12usize,
               concat!("Offset of field: ",
                       stringify!(Sci_Rectangle),
                       "::",
                       stringify!(bottom)));
}
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct Sci_RangeToFormat {
    pub hdc: Sci_SurfaceID,
    pub hdcTarget: Sci_SurfaceID,
    pub rc: Sci_Rectangle,
    pub rcPage: Sci_Rectangle,
    pub chrg: Sci_CharacterRange,
}
# [ test ]
fn bindgen_test_layout_Sci_RangeToFormat() {
    assert_eq!(::std::mem::size_of::<Sci_RangeToFormat>(),
               56usize,
               concat!("Size of: ", stringify!(Sci_RangeToFormat)));
    assert_eq!(::std::mem::align_of::<Sci_RangeToFormat>(),
               8usize,
               concat!("Alignment of ", stringify!(Sci_RangeToFormat)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_RangeToFormat>())).hdc as *const _ as usize },
               0usize,
               concat!("Offset of field: ",
                       stringify!(Sci_RangeToFormat),
                       "::",
                       stringify!(hdc)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<Sci_RangeToFormat>())).hdcTarget as *const _ as usize
               },
               8usize,
               concat!("Offset of field: ",
                       stringify!(Sci_RangeToFormat),
                       "::",
                       stringify!(hdcTarget)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_RangeToFormat>())).rc as *const _ as usize },
               16usize,
               concat!("Offset of field: ",
                       stringify!(Sci_RangeToFormat),
                       "::",
                       stringify!(rc)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<Sci_RangeToFormat>())).rcPage as *const _ as usize
               },
               32usize,
               concat!("Offset of field: ",
                       stringify!(Sci_RangeToFormat),
                       "::",
                       stringify!(rcPage)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_RangeToFormat>())).chrg as *const _ as usize },
               48usize,
               concat!("Offset of field: ",
                       stringify!(Sci_RangeToFormat),
                       "::",
                       stringify!(chrg)));
}
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct Sci_NotifyHeader {
    pub hwndFrom: *mut ::std::os::raw::c_void,
    pub idFrom: uptr_t,
    pub code: ::std::os::raw::c_uint,
}
# [ test ]
fn bindgen_test_layout_Sci_NotifyHeader() {
    assert_eq!(::std::mem::size_of::<Sci_NotifyHeader>(),
               24usize,
               concat!("Size of: ", stringify!(Sci_NotifyHeader)));
    assert_eq!(::std::mem::align_of::<Sci_NotifyHeader>(),
               8usize,
               concat!("Alignment of ", stringify!(Sci_NotifyHeader)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<Sci_NotifyHeader>())).hwndFrom as *const _ as usize
               },
               0usize,
               concat!("Offset of field: ",
                       stringify!(Sci_NotifyHeader),
                       "::",
                       stringify!(hwndFrom)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_NotifyHeader>())).idFrom as *const _ as usize },
               8usize,
               concat!("Offset of field: ",
                       stringify!(Sci_NotifyHeader),
                       "::",
                       stringify!(idFrom)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<Sci_NotifyHeader>())).code as *const _ as usize },
               16usize,
               concat!("Offset of field: ",
                       stringify!(Sci_NotifyHeader),
                       "::",
                       stringify!(code)));
}
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct SCNotification {
    pub nmhdr: Sci_NotifyHeader,
    pub position: Sci_Position,
    pub ch: ::std::os::raw::c_int,
    pub modifiers: ::std::os::raw::c_int,
    pub modificationType: ::std::os::raw::c_int,
    pub text: *const ::std::os::raw::c_char,
    pub length: Sci_Position,
    pub linesAdded: Sci_Position,
    pub message: ::std::os::raw::c_int,
    pub wParam: uptr_t,
    pub lParam: sptr_t,
    pub line: Sci_Position,
    pub foldLevelNow: ::std::os::raw::c_int,
    pub foldLevelPrev: ::std::os::raw::c_int,
    pub margin: ::std::os::raw::c_int,
    pub listType: ::std::os::raw::c_int,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub token: ::std::os::raw::c_int,
    pub annotationLinesAdded: Sci_Position,
    pub updated: ::std::os::raw::c_int,
    pub listCompletionMethod: ::std::os::raw::c_int,
}
# [ test ]
fn bindgen_test_layout_SCNotification() {
    assert_eq!(::std::mem::size_of::<SCNotification>(),
               152usize,
               concat!("Size of: ", stringify!(SCNotification)));
    assert_eq!(::std::mem::align_of::<SCNotification>(),
               8usize,
               concat!("Alignment of ", stringify!(SCNotification)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).nmhdr as *const _ as usize },
               0usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(nmhdr)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).position as *const _ as usize },
               24usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(position)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).ch as *const _ as usize },
               32usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(ch)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<SCNotification>())).modifiers as *const _ as usize
               },
               36usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(modifiers)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<SCNotification>())).modificationType as *const _ as usize
               },
               40usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(modificationType)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).text as *const _ as usize },
               48usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(text)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).length as *const _ as usize },
               56usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(length)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<SCNotification>())).linesAdded as *const _ as usize
               },
               64usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(linesAdded)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).message as *const _ as usize },
               72usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(message)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).wParam as *const _ as usize },
               80usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(wParam)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).lParam as *const _ as usize },
               88usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(lParam)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).line as *const _ as usize },
               96usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(line)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<SCNotification>())).foldLevelNow as *const _ as usize
               },
               104usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(foldLevelNow)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<SCNotification>())).foldLevelPrev as *const _ as usize
               },
               108usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(foldLevelPrev)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).margin as *const _ as usize },
               112usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(margin)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).listType as *const _ as usize },
               116usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(listType)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).x as *const _ as usize },
               120usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(x)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).y as *const _ as usize },
               124usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(y)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).token as *const _ as usize },
               128usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(token)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<SCNotification>())).annotationLinesAdded as *const _ as
                   usize
               },
               136usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(annotationLinesAdded)));
    assert_eq!(unsafe { &(*(::std::ptr::null::<SCNotification>())).updated as *const _ as usize },
               144usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(updated)));
    assert_eq!(unsafe {
                   &(*(::std::ptr::null::<SCNotification>())).listCompletionMethod as *const _ as
                   usize
               },
               148usize,
               concat!("Offset of field: ",
                       stringify!(SCNotification),
                       "::",
                       stringify!(listCompletionMethod)));
}
pub type __builtin_va_list = *mut ::std::os::raw::c_char;
# [ repr ( C ) ]
# [ derive ( Debug , Copy , Clone ) ]
pub struct lconv {
    pub _address: u8,
}
